# 基本功能

## 重新索引

In [1]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [2]:
obj = Series([4.5,7.2,-5.3,3.6],index=['d','b','a','c'])

In [3]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [6]:
# Series的reindex将会根据新索引进行重排
# 如果某个索引值不存在，就引入缺失值
obj2 = obj.reindex(['a','b','c','d','e'])

In [8]:
# 以下方法之前也介绍过，
# 但这种方法如果之后调用obj3['e']（对缺失值调用）会发生错误
obj3 = obj[['a','b','c','d','e']]

C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\series.py:851: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike
  return self.loc[key]

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [11]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [12]:
# 对缺失值进行填充
obj.reindex(['a','b','c','d','e'],fill_value=0)

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [13]:
# 对于时间序列这样的有序序列，重新索引可能需要做插值处理
# method选项    其中ffill可以实现向前填充
obj3 = Series(['blue','purple','yellow'],index=[0,2,4])

In [14]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [15]:
#ffill 或者 pad
obj3.reindex(range(6),method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [19]:
# bfill或者backfill
obj3.reindex(range(6),method='bfill')

0      blue
1    purple
2    purple
3    yellow
4    yellow
5       NaN
dtype: object

对于DataFrame，reindex对于行列索引都可以修改，如果仅传入一个序列则只索引行

In [34]:
frame = DataFrame(np.arange(9).reshape((3,3)),index=['a','c','d'],columns=['Ohio','Texas','California'])

In [35]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [36]:
frame2 = frame.reindex(['a','b','c','d'])

In [37]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [38]:
#使用columns可以重新索引列
states = ['Texas','Utah','California']

In [43]:
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [53]:
# 同时对行列进行重新索引，插值则只能按照行
# 这里原书是frame.reindex(index=['a','b','c','d'],method='ffill',columns=states)会报错
frame.reindex(index=['a','b','c','d'],columns=states).ffill()

   Texas  Utah  California
a    1.0   NaN         2.0
b    1.0   NaN         2.0
c    4.0   NaN         5.0
d    7.0   NaN         8.0

In [54]:
# 利用ix的标签索引功能
frame.ix[['a','b','c','d'],states]

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

## 丢弃指定轴上的项

In [55]:
# drop方法返回指定轴上删除了指定值的新对象
obj = Series(np.arange(5),index=['a','b','c','d','e'])
new_obj = obj.drop('c')

In [56]:
new_obj

a    0
b    1
d    3
e    4
dtype: int32

In [57]:
obj.drop(['d','c'])

a    0
b    1
e    4
dtype: int32

删除dataframe 任意轴上的索引值

In [58]:
data = DataFrame(np.arange(16).reshape((4,4)),
                 index=['Ohio','Colorado','Utah','New York'],
                columns=['one','two','three','four'])

In [59]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [60]:
data.drop(['Colorado','Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [62]:
data.drop('two',axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [63]:
data.drop(['two','four'],axis=1)

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

## 索引、选取、过滤

> Series索引类似于Numpy数组的索引，知识索引值不只是整数

In [65]:
obj = Series(np.arange(4),index=['a','b','c','d'])

In [66]:
obj

a    0
b    1
c    2
d    3
dtype: int32

In [67]:
obj['b']

1

In [68]:
obj[1]

1

In [69]:
obj[2:4]

c    2
d    3
dtype: int32

In [70]:
obj[['b','a','d']]

b    1
a    0
d    3
dtype: int32

In [71]:
obj[[1,3]]

b    1
d    3
dtype: int32

In [72]:
obj[obj < 2]

a    0
b    1
dtype: int32

**利用标签的切片运算与普通的python切片运算不同，末端是包含的**

In [73]:
obj['b':'c']

b    1
c    2
dtype: int32

In [74]:
obj['b':'c'] = 5

In [75]:
obj

a    0
b    5
c    5
d    3
dtype: int32

对DataFrame进行索引就是获取一个或多个列

In [77]:
data = DataFrame(np.arange(16).reshape((4,4)),
                 index=['Ohio','Colorado','Utah','New York'],
                columns=['one','two','three','four'])

In [78]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [79]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [80]:
data[['three','one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

**特殊情况：**通过切片或布尔型数组可以选取行

In [81]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [82]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [85]:
data[1:2]

          one  two  three  four
Colorado    4    5      6     7

In [86]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [88]:
data[data < 5] = 0

In [89]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15


通过索引字段ix可以进行行列子集的选取

In [91]:
data.ix['Colorado',['two','three']]

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

two      5
three    6
Name: Colorado, dtype: int32

In [93]:
data.ix[['Colorado','Utah'],[3,0,1]]

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [96]:
data.ix[2]

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [97]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [98]:
data.ix[:'Utah','two']

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [99]:
data.ix[data.three > 5,:3]

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

5

## 算数运算和数据对齐

> pandas 可以对不同索引的对象进行算数运算，对象相加时，如果存在不同的索引，结果的索引就是对该索引对的并集,不重叠的索引值为NA

In [107]:
s1 = Series([7.3,-2.5,3.4,1.5],index=['a','c','d','e'])

In [108]:
s2 = Series([1,2,3,4,5],index=['a','c','e','f','g'])

In [109]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [110]:
s2

a    1
c    2
e    3
f    4
g    5
dtype: int64

In [111]:
s1 + s2

a    8.3
c   -0.5
d    NaN
e    4.5
f    NaN
g    NaN
dtype: float64

In [112]:
df1 = DataFrame(np.arange(9).reshape((3,3)),columns=list('bcd'),
               index=['Ohio','Texas','Colorado'])

In [113]:
df2 = DataFrame(np.arange(12).reshape((4,3)),columns=list('bde'),
               index=['Utah','Ohio','Texas','Oregon'])

In [114]:
df1

          b  c  d
Ohio      0  1  2
Texas     3  4  5
Colorado  6  7  8

In [115]:
df2

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [116]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

## 在算术方法中填充值

当一个对象中某个轴标签在另一个对象中找不到时填充一个特殊值

In [117]:
df1 = DataFrame(np.arange(12).reshape((3,4)),columns=list('abcd'))

In [118]:
df2 = DataFrame(np.arange(20).reshape((4,5)),columns=list('abcde'))

In [119]:
df1

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [120]:
df2

    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [121]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

使用df1 add方法，传入df2以及一个fill_value参数

In [122]:
df1.add(df2,fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

在对Series或者DataFrame重新索引时，也可以指定填充值

In [123]:
df1.reindex(columns=df2.columns,fill_value=0)

   a  b   c   d  e
0  0  1   2   3  0
1  4  5   6   7  0
2  8  9  10  11  0

## DataFrame和Series之间的运算

In [124]:
arr = np.arange(12).reshape((3,4))

In [125]:
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [126]:
arr[0]

array([0, 1, 2, 3])

In [127]:
arr - arr[0]

array([[0, 0, 0, 0],
       [4, 4, 4, 4],
       [8, 8, 8, 8]])

上述运算叫做广播，DataFrame和Series之间的运算也类似

In [128]:
frame = DataFrame(np.arange(12).reshape((4,3)),columns=list('bde'),
                index=['Utah','Ohio','Texas','Oregon'])

In [129]:
frame

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [131]:
series = frame.ix[0]

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

In [132]:
series

b    0
d    1
e    2
Name: Utah, dtype: int32

In [133]:
frame - series

        b  d  e
Utah    0  0  0
Ohio    3  3  3
Texas   6  6  6
Oregon  9  9  9

In [134]:
series2 = Series(range(3),index=['b','e','f'])

In [135]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

匹配行并且在列上广播，需要使用算术方法

In [136]:
series3 = frame['d']

In [137]:
frame

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [139]:
series3

Utah       1
Ohio       4
Texas      7
Oregon    10
Name: d, dtype: int32

In [140]:
frame.sub(series3,axis=0)

        b  d  e
Utah   -1  0  1
Ohio   -1  0  1
Texas  -1  0  1
Oregon -1  0  1

## 函数应用和映射

Numpy的ufuncs（元素级数组方法）也可用于操作pandas对象

In [141]:
frame = DataFrame(np.random.randn(4,3),columns=list('bde'),
                 index=['Utah','Ohio','Texas','Oregon'])

In [142]:
frame

               b         d         e
Utah    0.299192 -0.173454  1.479802
Ohio   -1.238835 -1.043053  0.193150
Texas   0.405872 -1.126784  1.499060
Oregon -1.039240 -0.606706  0.203807

In [143]:
np.abs(frame)

               b         d         e
Utah    0.299192  0.173454  1.479802
Ohio    1.238835  1.043053  0.193150
Texas   0.405872  1.126784  1.499060
Oregon  1.039240  0.606706  0.203807

apply方法 将函数应用到各行或各列形成的一维数组上

In [144]:
f = lambda x:x.max() - x.min()

In [145]:
frame.apply(f)

b    1.644707
d    0.953331
e    1.305909
dtype: float64

In [146]:
frame.apply(f,axis=1)

Utah      1.653255
Ohio      1.431985
Texas     2.625844
Oregon    1.243047
dtype: float64

applymap  元素级的python函数

In [147]:
format = lambda x: '%.2f' % x

In [148]:
frame.applymap(format)

            b      d     e
Utah     0.30  -0.17  1.48
Ohio    -1.24  -1.04  0.19
Texas    0.41  -1.13  1.50
Oregon  -1.04  -0.61  0.20

Series也有一个应用于元素级的map方法

In [149]:
frame['e'].map(format)

Utah      1.48
Ohio      0.19
Texas     1.50
Oregon    0.20
Name: e, dtype: object

## 排序和排名
> sort_index 对行或列索引进行排序

In [150]:
obj = Series(range(4),index=['d','a','b','c'])

In [151]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [152]:
frame = DataFrame(np.arange(8).reshape((2,4)),index=['three','one'],
                 columns=['d','a','b','c'])

In [153]:
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [155]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [156]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [157]:
# 降序
frame.sort_index(axis=1,ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

按值对Series排序，用sort_values方法  书中说的是用order方法已经用不了了

In [158]:
obj = Series([4,7,-3,-2])

In [160]:
obj.sort_values()

2   -3
3   -2
0    4
1    7
dtype: int64

根据一个或多个列中的值排序，将一个或多个列的名字传递给by

In [161]:
frame = DataFrame({'b':[4,7,-3,2],'a':[0,1,0,1]})

In [162]:
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [163]:
frame.sort_index(by='b')

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: by argument to sort_index is deprecated, please use .sort_values(by=...)
  """Entry point for launching an IPython kernel.

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [164]:
frame.sort_index(by = ['a','b'])

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: by argument to sort_index is deprecated, please use .sort_values(by=...)
  """Entry point for launching an IPython kernel.

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

排名  rank通过给各组分配一个平均排名

In [165]:
obj = Series([7,-5,7,4,2,0,4])

In [166]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

根据值在原数据中出现的顺序给出排名

In [167]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [168]:
obj.rank(ascending=False,method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [169]:
frame = DataFrame({'b':[4.3,7,-3,2],'a':[0,7,-3,2],
                   'c':[3,2,3,1]})

In [170]:
frame

     b  a  c
0  4.3  0  3
1  7.0  7  2
2 -3.0 -3  3
3  2.0  2  1

In [171]:
frame.rank(axis = 0)

     b    a    c
0  3.0  2.0  3.5
1  4.0  4.0  2.0
2  1.0  1.0  3.5
3  2.0  3.0  1.0

In [172]:
frame.rank(axis = 1)

     b    a    c
0  3.0  1.0  2.0
1  2.5  2.5  1.0
2  1.5  1.5  3.0
3  2.5  2.5  1.0


## 带有重复值的轴索引

In [173]:
obj = Series(range(5),index=['a','a','b','b','c'])

In [174]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [175]:
#is_unique确定属性是否唯一
obj.index.is_unique

False

In [176]:
obj['a']

a    0
a    1
dtype: int64

In [177]:
obj['c']

4

In [178]:
df = DataFrame(np.random.rand(4,3),index=['a','a','b','b'])

In [179]:
df

          0         1         2
a  0.954352  0.240722  0.098235
a  0.889600  0.370744  0.476182
b  0.691008  0.961778  0.883509
b  0.392673  0.775605  0.090050

In [180]:
df.ix['b']

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

          0         1         2
b  0.691008  0.961778  0.883509
b  0.392673  0.775605  0.090050